# RebarWorkshopInstructions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarWorkshopInstructions Property
ParameterTypeId Class See Also
---
"Workshop Instructions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarWorkshopInstructions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarWorkshopInstructions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarWorkshopInstructions {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace